package lesson6;

public class TaskForLesson {
    /*
    1)Создать бесконечный цикл, который будет спрашивать ввести у пользователя
    с клавиатуры число, и суммировать все введенные пользователем числа до тех пор,
    пока он не введет с клавиатуры слово FINAL.
    Конечную сумму программа должна вывести в консоль после завершения цикла.

    2)Заполнить массив на 45 элементов случайными числами
    от -50 до +50. Вывести в консоль сумму всех его элементов.

    3)Заполнить массив на 45 элементов случайными числами
    от -13 до +30. Вывести в консоль все его нечетные числа которые делятся на три.

    4)Заполнить массив на 20 элементов случайными числами от 0 до 100.
    Вывести в консоль все значения данного массива.
    Найти минимальный элемент и вывести его на консоль.

    5)Необходимо вывести на экран перевернутый прямоугольный треугольник прямым углом сверху в левой части.
    Для вывода использовать условные операторы, циклы.
    Команду System.out.println(); System.out.print(); и можно использовать только с одним символом *.
    Пользователь вводит с клавиатуры число, которое будет считаться основанием треугольника,
    а программа выводит сам треугольник.
    Пример с числом 7:
    *******
    ******
    *****
    ****
    ***
    **
    *
    Необходимо написать программу для вывода вначале заполненного, а потом и пустого треугольника.

    6)Имеется массив, размер которого должен быть четным числом и этот размер
    вводится пользователем с клавиатуры. Значения элементов задаются случайным
    образом в диапазоне от 0 до 100. Отсортировать первую половину данного
    массива по возрастанию, а вторую по убыванию. Вывести на экран изначальный
    и отсортированный массив.

    7)Пользователь задает размерность двумерного массива с клавиатуры.
    Массив заполняется случайными числами от 0 до 1000.
    Необходимо создать одномерный массив, состоящий из максимальных значений
    каждого отдельного массива входящего в двумерный.
    Новый полученный массив вывести на экран.
    */
}
