package lesson2;

public class StringMethods {
    public static void main(String[] args) {
        //valueOf -возвращает строковое представление
        //значений примитивных типов.


        // символы экранирования \n, \", \', \b


        //Все методы класса String не изменяют строку, а возвращают ссылку на новый объект
        //конкатенация


        //charAt – возвращает символ из строки по указанному индексу;


        //length – возвращает количество символов в строке.


        //isEmpty – есди строка пустая возвращает истину,
        //если нет - ложь.


        //contains – возвращает истину, если в строке
        //хотя бы раз встречается указанная строка.


        //startsWith – возвращает истину, если указанный символ или строка
        // совпадают с началом строки.


        //toLowerCase – возвращае строку в нижнем регистре.
        //toUpperCase – возвращает строку, в верхнем регистре.


        //indexOf – ищет указанный символ начиная с начала строки.

        //lastIndexOf ищет с конца


        //substring – вырезает указанный промежуток символов
        //возвращает новую строку


        //split


        //replace – возвращает строку, заменяя указанные символы или строки.
    }

}
