package lesson6.lesson5.foreach;

public class General {
    //Цикл for each это разновидность цикла for,
    // который используется для перебора массива
    // или коллекции без ручного изменения переменной
    // шага для перебора. Цикл for each выполняет эту работу автоматически.


    //Пользователь задает размерность двумерного массива с клавиатуры.
    //Массив заполняется случайными числами от 0 до 1000.
    //Необходимо создать одномерный массив, состоящий из максимальных значений
    //каждого отдельного массива входящего в двумерный.
    //Новый полученный массив вывести на экран.

}
