package lesson8;

public class HomeWorkLesson8 {
    /*   1) Написать метод, принимающий в качестве параметра массив целых чисел. И выводит на экран все четные числа списком,
         а также нечетные числа списком.


         2) Написать перегруженный метод, который может:
         - не принимать никаких значений, тогда он будет выводить на консоль сообщение типа:
         "Я пустой".
         - Принимать в качестве параметров String, тогда он будет выводить на консоль это сообщение.
         - Принимать в качестве параметров массив строк, тогда он будет выводить на консоль все его значения
         через пробел.
         - Принимать в качестве параметра массив чисел, тогда он будет выводить на консоль сумму элементов
         массива.
         - Принимать в качестве параметров число и строку, тогда он будет выводить на консоль сообщение типа:
         "Ваше сообщение - "%%%%%%%%", ваше число -  $",
         где "%%%%%%%%" и $ ваши введенные строка и число соответственно.


        3)  Создать класс Конспект. Класс должен содержать следующие поля:
            название предмета;
            ФИО студента;
            количество страниц;
            год выпуска;
            цвет обложки.
            Название заведения, где учится студент;

        4)  Пользователь задает размерность двумерного массива с клавиатуры.
    Массив заполняется случайными числами от 0 до 1000.
    Необходимо создать одномерный массив, состоящий из максимальных значений
    каждого отдельного массива входящего в двумерный.
    Новый полученный массив вывести на экран.

        5)  Написати програму "стрільба по цілі".
                      Технічні вимоги:
Даний квадрат 5х5, де програма випадковим чином ставить ціль.
Перед початком гри на екран виводиться текст: All Set. Get ready to rumble!.
Сам процес гри обробляється у нескінченному циклі.
гравцеві пропонується ввести лінію для стрільби; програма перевіряє, щоб було введено число, і введена лінія знаходиться в межах ігрового поля (1-5). У випадку, якщо гравець помилився, пропонує ввести число ще раз.
Гравцю пропонується ввести стовпчик для стрільби (має проходити аналогічну перевірку).
Після кожного пострілу необхідно показувати оновлене ігрове поле у консолі. Клітинки, куди гравець вже стріляв, слід зазначити як *.
Гра закінчується при попаданні в ціль. Наприкінці гри вивести в консоль фразу You have won!, а також ігрове поле. Уражену ціль відзначити як x.
Завдання повинно бути виконане за допомогою масивів (НЕ використовуйте інтерфейси List, Set, Map).
Приклад виведення в консоль:

 0 | 1 | 2 | 3 | 4 | 5 |
 1 | - | - | - | - | - |
 2 | - | * | * | - | - |
 3 | * | - | - | * | - |
 4 | - | - | - | - | * |
 5 | * | - | * | - | - |

 */
}
