package lesson8;

public class LessonTask {
    public static void main(String[] args) {
        /*
         1) Написать метод, принимающий в качестве параметров два числа,
         который будет выводить на консоль сумму этих двух чисел.

         Написать второй метод, который будет возвращать сумму двух чисел,
         которые он будет принимать в параметре метода.
         Вывести на консоль сумму двух любых чисел при помощи первого и второго метода.

         2) Написать метод, принимающий в качестве параметра массив целых чисел. И выводит на экран все четные числа списком,
         а также нечетные числа списком.


         3) Написать перегруженный метод, который может:
         - не принимать никаких значений, тогда он будет выводить на консоль сообщение типа:
         "Я пустой".
         - Принимать в качестве параметров String, тогда он будет выводить на консоль это сообщение.
         - Принимать в качестве параметров массив строк, тогда он будет выводить на консоль все его значения
         через пробел.
         - Принимать в качестве параметра массив чисел, тогда он будет выводить на консоль сумму элементов
         массива.
         - Принимать в качестве параметров число и строку, тогда он будет выводить на консоль сообщение типа:
         "Ваше сообщение - "%%%%%%%%", ваше число -  $",
         где "%%%%%%%%" и $ ваши введенные строка и число соответственно.


        4)  Создать класс Конспект. Класс должен содержать следующие поля:
            название предмета;
            ФИО студента;
            количество страниц;
            год выпуска;
            цвет обложки.
            Название заведения, где учится студент;
        */
    }
}
